#include <iostream>
#include"LinkedList.h"


using namespace std;



int main()
{
	setlocale(0, "");



	LinkedList<int> arr = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };

	// Протестированно для рекусривных и процедурными методами
	cout << arr[0] << " " << arr[1] << " " << arr[2];



//	setlocale(0, "");
//	
//	LinkedList<int> arr = {1, 2, 3, 4, 5, 6, 7, 8, 9};
//	cout << "Первоначальный массив: " << endl;
//	arr.OutPut();
//	cout << endl;
//
//
/////////////// Добавление элемента /////////////////////////////////////////////////////////////////
//
//	cout << "Добавляем элемент(111) в конец" << endl;
//	arr.push_back(111);
//	cout << arr << endl;
//
//	cout << "Добавляем элемент(999) в начало" << endl;
//	arr.push_front(999);
//	cout << arr << endl;
//
//	cout << "Добавляем элемент(10) на 5 позицию" << endl;
//	arr.insert(10, 4);
//	cout << arr << endl;
//
//
///////////////////// Удаление элемента ///////////////////////////////////////////////////////////
//
//
//	cout << "Удаляем последний элемент" << endl;
//	arr.pop_back();
//	cout << arr << endl;
//
//	arr.pop_front();
//	cout << "Удаляем первый элеменет" << endl;
//	cout << arr << endl;
//
//	arr.pop(1);
//	cout << "Удаляем 2 элеменет" << endl;
//	cout << arr << endl;
//
//
//////////////  Копирование списков ////////////////////////////////////////////////
//
//
//
//	arr.OutPut();
//
//	LinkedList<int> arr2;
//	arr2 = arr;
//	cout << endl << "Копирование массива" << endl;
//	cout << arr2 << endl;
//	arr.clear();
//	arr2.clear();
//
//
//
////////////////////// Очистка списка //////////////////////////////////////////////////
//
//
//	cout << "Очистка массива..." << endl;
//	
//	cout << "Элементов в массиве - " << arr.size() << endl;
//
//
}